slowpoke/boutique/microbench-fixed-number/fixed-time-mix-varing-time-1cpu.log
[run.sh] Running the actual test 1 with duration 30
Running 30s test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   145.60ms   92.51ms 738.78ms   67.66%
    Req/Sec   452.29    100.67     1.28k    66.85%
  Latency Distribution
     50%  146.63ms
     75%  200.28ms
     90%  268.31ms
     99%  399.01ms
  107895 requests in 30.02s, 67.87MB read
Requests/sec:   3593.53
Transfer/sec:      2.26MB
[run.sh] Running the actual test 2 with duration 60
Running 1m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   143.93ms   92.03ms 908.45ms   68.30%
    Req/Sec   459.20     98.65   757.00     64.94%
  Latency Distribution
     50%  143.03ms
     75%  198.18ms
     90%  265.87ms
     99%  399.24ms
  219520 requests in 1.00m, 140.60MB read
Requests/sec:   3656.19
Transfer/sec:      2.34MB
[run.sh] Running the actual test 3 with duration 90
Running 2m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   145.84ms   93.04ms 970.96ms   67.71%
    Req/Sec   452.51     96.89     1.03k    65.56%
  Latency Distribution
     50%  147.45ms
     75%  200.58ms
     90%  269.23ms
     99%  398.30ms
  324502 requests in 1.50m, 214.22MB read
Requests/sec:   3603.31
Transfer/sec:      2.38MB
[run.sh] Running the actual test 4 with duration 120
Running 2m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   145.48ms   92.17ms 925.07ms   67.89%
    Req/Sec   453.57     98.88   787.00     65.57%
  Latency Distribution
     50%  146.43ms
     75%  200.01ms
     90%  267.51ms
     99%  397.17ms
  433691 requests in 2.00m, 298.58MB read
Requests/sec:   3611.93
Transfer/sec:      2.49MB
[run.sh] Running the actual test 5 with duration 150
Running 2m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   148.85ms   95.81ms 893.85ms   67.37%
    Req/Sec   444.31     97.35   840.00     66.53%
  Latency Distribution
     50%  152.88ms
     75%  203.22ms
     90%  275.19ms
     99%  407.27ms
  530955 requests in 2.50m, 384.46MB read
Requests/sec:   3537.48
Transfer/sec:      2.56MB