slowpoke/boutique/microbench-fixed-number/fixed-time-mix-varing-time.log
[run.sh] Running the actual test 1 with duration 30
Running 30s test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    83.98ms   53.75ms 600.59ms   66.18%
    Req/Sec   788.16    131.90     1.17k    70.46%
  Latency Distribution
     50%   84.51ms
     75%  115.18ms
     90%  149.33ms
     99%  237.15ms
  188338 requests in 30.02s, 118.45MB read
Requests/sec:   6273.87
Transfer/sec:      3.95MB
[run.sh] Running the actual test 2 with duration 60
Running 1m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.34ms   51.95ms 529.39ms   64.79%
    Req/Sec   814.09    130.52     1.25k    69.49%
  Latency Distribution
     50%   82.65ms
     75%  112.46ms
     90%  145.50ms
     99%  226.02ms
  388992 requests in 1.00m, 252.17MB read
Requests/sec:   6479.40
Transfer/sec:      4.20MB
[run.sh] Running the actual test 3 with duration 90
Running 2m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.10ms   52.38ms 496.14ms   64.71%
    Req/Sec   806.21    124.24     1.21k    69.71%
  Latency Distribution
     50%   83.60ms
     75%  113.47ms
     90%  146.88ms
     99%  227.30ms
  577970 requests in 1.50m, 399.05MB read
Requests/sec:   6418.38
Transfer/sec:      4.43MB
[run.sh] Running the actual test 4 with duration 120
Running 2m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.98ms   52.49ms 478.20ms   64.56%
    Req/Sec   796.51    124.03     1.20k    69.19%
  Latency Distribution
     50%   84.65ms
     75%  114.78ms
     90%  148.10ms
     99%  227.43ms
  761345 requests in 2.00m, 558.71MB read
Requests/sec:   6341.76
Transfer/sec:      4.65MB
[run.sh] Running the actual test 5 with duration 150
Running 2m test @ http://frontend:80
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    83.72ms   54.52ms   1.26s    66.66%
    Req/Sec   792.58    124.86     1.20k    68.88%
  Latency Distribution
     50%   84.53ms
     75%  115.19ms
     90%  148.63ms
     99%  231.67ms
  946946 requests in 2.50m, 739.63MB read
Requests/sec:   6309.99
Transfer/sec:      4.93MB